/*
 * @Description: 验证
 * @Author: jinxiaoshan
 * @Date: 2022-03-01 08:43:33
 */
var rulesConfig = {
    // 正负整数
    integer: {
        msg: "请输入整数",
        reg: /^-?\d+$/
    },
    // 0+正整数
    number: {
        msg: "请输入整数",
        reg: /^[0-9]*$/
    },
    // 正整数
    nonzero: {
        msg: "请输入数值大于0",
        reg: /^[1-9]\d*$/
    },
    // 数字类型
    float: {
        msg: "请输入数值",
        reg: /^(-?\d+)(\.\d+)?$/
    },
    // >0数值
    justfloat: {
        msg: "请输入>=0数值",
        reg: /^(\d+)(\.\d+)?$/
    },
    // 1位小数
    float1: {
        msg: "1位小数",
        reg: /^(\d+)(\.\d{1})?$/
    },
    // 2位小数
    float2: {
        msg: "2位小数",
        reg: /^(\d+)(\.\d{1,2})?$/
    },
    // 用户名
    userStart: {
        msg: "只能以字母开头",
        reg: /^[a-zA-Z_].*/
    },
    // 数据表名
    dbName: {
        msg: "格式错误",
        reg: /^(?!_)(?!.*?_$)[a-z_]+$/
    },
    // 姓名
    fullName: {
        msg: "2-8个中文字符",
        reg: /^[\u4e00-\u9fa5]{2,8}$/
    },
    // 字母
    letterText: {
        msg: "只能输入字母",
        reg: /^[a-z]+$/
    },
    // 账户
    userText: {
        msg: "只能输入字母和数字",
        reg: /^[a-zA-Z0-9]+$/
    },
    // 长度限制
    userLen: {
        msg: "长度在4~20个字符",
        reg: /^.{4,20}$/
    },
    pwdLen: {
        msg: "长度在6~20个字符",
        reg: /^.{6,20}$/
    },
    // 联系方式
    phone: {
        msg: "联系方式格式错误",
        reg: /(\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$/
    },
    // 手机号
    tel: {
        msg: "手机号格式错误",
        reg: /^[1][3-9][\d]{9}$/
    },
    // 座机号码
    telephone: {
        msg: "座机号码格式错误",
        reg: /^(0\d{2,3})-?(\d{7,8})$/
    },
    // 电子邮箱
    email: {
        msg: "邮箱格式错误",
        reg: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/
    },
    // 超链接
    http: {
        msg: "链接格式错误",
        reg: /^((http|https|(blob:http)):\/\/).*$/
    },
    // 端口号
    port: {
        msg: "端口范围0-65535",
        reg: /^([0-9]|[1-9]\d|[1-9]\d{2}|[1-9]\d{3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/
    },
    // 身份证
    idcard: {
        msg: "身份证格式错误",
        reg: /^[1-9]\d{5}(19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/
        // reg: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/
    },
    // 邮政编码
    idcard: {
        msg: "邮政编码格式错误",
        reg: /^[1-9]\d{5}$/
    }
};
export default rulesConfig;
